Конфигурация/Documents/ПереоценкаКредитныхИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПереоценкаКредитныхИнструментов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоцениватьНаОснованииНастроекУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КредитныеИнструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КредитныйИнструмент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номинал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БалансоваяСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценочнаяСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоЭСП</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ПереоценкаКредитныхИнструментов/Ext/ManagerModule.bsl
Функция ОпределятьСтоимостьКредитныхИнструментовКакВРСА(ВидУчета, ВидДоговораДоверительногоУправления) Экспорт
	
	Возврат ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет 
		И ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда;
		
КонецФункции
	
Функция ОпределитьСтоимостьКредитныхИнструментов(Организация, СчетДоверительногоУправления, Период, ВидУчета, ОпределятьСтоимостьКредитныхИнструментовКакВРСА, Отказ) Экспорт
	
	Если ОпределятьСтоимостьКредитныхИнструментовКакВРСА Тогда
		Возврат РаботаСКредитнымиИнструментами.ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияДляРСА(
			СчетДоверительногоУправления,
			Период,
			Неопределено,
			Ложь, 
			Истина,,
			Отказ);
	Иначе		
		Возврат РаботаСКредитнымиИнструментами.ПолучитьСтоимостиКредитныхИнструментовПоСчетуДоверительногоУправленияДляБухгалтерскойПереоценки(
			Организация, 
			СчетДоверительногоУправления, 
			Период, 
			ВидУчета, 
			Неопределено);
	КонецЕсли;
	
КонецФункции
